New Logs V2/AirPrice-Request.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <AirPriceReq xmlns="http://www.travelport.com/schema/air_v52_0" TraceId="c8f38268010611bc23e5-01969005035" TargetBranch="P7212436"
            CheckOBFees="TicketingOnly" FareRuleType="long" CheckFlightDetails="true">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v52_0" OriginApplication="UAPI" />
            <AirItinerary>

                <AirSegment Key="0rg3gPTqWDKAXi4ERAAAAA==" Group="0" Carrier="UL" FlightNumber="403" Origin="BKK" Destination="CMB" DepartureTime="2025-01-20T09:00:00.000+07:00" ArrivalTime="2025-01-20T11:00:00.000+05:30" FlightTime="210" Distance="1485" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Polled avail used" OptionalServicesIndicator="false" AvailabilitySource="S" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G">
                    <AirAvailInfo ProviderCode="1G"/>
                    <Connection />
                </AirSegment>
                <AirSegment Key="0rg3gPTqWDKAZi4ERAAAAA==" Group="0" Carrier="UL" FlightNumber="503" Origin="CMB" Destination="LHR" DepartureTime="2025-01-20T12:50:00.000+05:30" ArrivalTime="2025-01-20T19:10:00.000+00:00" FlightTime="710" Distance="5403" ETicketability="Yes" Equipment="333" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Polled avail used" OptionalServicesIndicator="false" AvailabilitySource="S" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G">
                    <AirAvailInfo ProviderCode="1G"/>
                </AirSegment>
                <AirSegment Key="0rg3gPTqWDKAbi4ERAAAAA==" Group="1" Carrier="UL" FlightNumber="504" Origin="LHR" Destination="CMB" DepartureTime="2025-01-24T20:40:00.000+00:00" ArrivalTime="2025-01-25T12:30:00.000+05:30" FlightTime="620" Distance="5403" ETicketability="Yes" Equipment="333" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Polled avail used" OptionalServicesIndicator="false" AvailabilitySource="S" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G">
                    <AirAvailInfo ProviderCode="1G"/>
                    <Connection />
                </AirSegment>
                <AirSegment Key="0rg3gPTqWDKAdi4ERAAAAA==" Group="1" Carrier="UL" FlightNumber="402" Origin="CMB" Destination="BKK" DepartureTime="2025-01-26T01:15:00.000+05:30" ArrivalTime="2025-01-26T06:20:00.000+07:00" FlightTime="215" Distance="1485" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Polled avail used" OptionalServicesIndicator="false" AvailabilitySource="S" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G">
                    <AirAvailInfo ProviderCode="1G"/>
                </AirSegment>

            </AirItinerary>
            <AirPricingModifiers ETicketability="Required" PlatingCarrier="UL" FaresIndicator="PublicAndPrivateFares" />
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v52_0" Code="ADT" BookingTravelerRef="ADT_0" />
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v52_0" Code="CNN" Age="8" BookingTravelerRef="CNN_0" />
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v52_0" Code="INF" Age="1" BookingTravelerRef="INF_0" />
            <AirPricingCommand />
        </AirPriceReq>
    </s:Body>
</s:Envelope>